tap 'caskroom/cask'
tap 'homebrew/bundle'

# Update out of date core utilities that ship with OSX
brew 'coreutils', args: ['--with-default-names']
brew 'findutils', args: ['--with-default-names']
brew 'gnu-sed', args: ['--with-default-names']
brew 'wget', args: ['--with-iri']

# Install Zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Install latest versions of some OS X tools.
brew 'vim', args: ['--override-system-vi']
# brew 'homebrew/dupes/grep', args: ['--with-default-names']
# brew 'homebrew/dupes/openssh'

brew 'git'
brew 'nvm'
brew 'the_silver_searcher'

cask '1password'
cask 'vlc'
cask 'iterm2'
cask 'postman'
cask 'docker'
cask 'whatsapp'
cask 'sublime-text'
cask 'google-chrome'
cask 'firefox'
cask 'aerial'
cask 'recordit'
cask 'flux'
cask 'oversight'
